tsung/SP-Tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <!-- <server host="siddarth.phtsmfeyep.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server> -->
    <server host="siddarth9999.phtsmfeyep.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>

    <!--
    <arrivalphase phase="6" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="7" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="8" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="9" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    -->
  </load>

  <options>
    <option name="global_ack_timeout" value="4000"></option>
  </options>

  <sessions>

    <session name="View Company" weight="1" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="4">
        <var name="company_id" />
      </setdynvars>

      <transaction name="companies">
        <request>
          <http url='/companies'></http>
        </request>
      </transaction>

      <transaction name="view_company_trades">
        <request subst="true">
          <http url='/companies/%%_company_id%%'></http>
        </request>
      </transaction>

      <transaction name="view_company_orders">
        <request subst="true">
          <http url='/companies/%%_company_id%%/orders'></http>
        </request>
      </transaction>
    </session>

    <!-- Maybe remove this session later!--> 
    <session name="View CEO User" weight="1" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="4">
        <var name="user_id" />
      </setdynvars>

      <transaction name="view_ceo">
        <request subst="true">
          <http url='/users/%%_user_id%%'></http>
        </request>
      </transaction>

      <transaction name="view_ceo_orders">
        <request subst="true">
          <http url='/users/%%_user_id%%/orders'></http>
        </request>
      </transaction>
    </session>

    <session name="Create User" weight="1" type="ts_http">
      <transaction name="users_index">
        <request>
          <http url='/users'></http>
        </request>
      </transaction>

      <transaction name="new_user">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url='/users/new'></http>
        </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <setdynvars sourcetype="random_string" length="5">
        <var name="rndstring" />
      </setdynvars>

      <transaction name="create_user">
        <request subst="true">
          <dyn_variable name="user_id" re="Location: http://.*/users/(.*)\r"/>
          <http 
            url='/users' 
            method='POST' 
            contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bname%5D=Usr-%%_rndstring%%">
          </http>
        </request>
      </transaction>

      <transaction name="view_user">
        <request subst="true">
          <http url='/users/%%_user_id%%'></http>
        </request>
      </transaction>

      <transaction name="view_user_orders">
        <request subst="true">
          <http url='/users/%%_user_id%%/orders'></http>
        </request>
      </transaction>

      <!-- PROCESS Deposits --> 
      <!-- 
        * Each user can deposit 5 times.
        * Any way to make it loop 'dynamic' times (ex. 1 or 4 times)? 
      --> 
      <for from="1" to="5" incr="1" var="counter">
        <thinktime value="2" random="true"></thinktime><!--DO NOT PUT THINKTIME IN TRANSACTION!-->

        <setdynvars sourcetype="random_number" start="0" end="500">
          <var name="amount" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="0" end="4">
          <var name="positive_or_negative" />
        </setdynvars>

        <transaction name="new_deposit">
          <request subst="true">
            <dyn_variable name="authenticity_token"/>
            <http url='/users/%%_user_id%%/deposits/new'></http>
          </request>
        </transaction>

        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
          <var name="authenticity_token"/>
        </setdynvars>

        <transaction name="create_deposit">
          <!-- Positive Deporit--> 
          <if var="positive_or_negative" gte="3">
            <request subst="true">
              <http 
                url='/users/%%_user_id%%/deposits' 
                method='POST' 
                contents="authenticity_token=%%_authenticity_token%%&amp;deposit%5Bamount%5D=%%_amount%%">
              </http>
            </request>
          </if>
          <!-- Negative Deporit--> 
          <if var="positive_or_negative" lt="3">
            <request subst="true">
              <http 
                url='/users/%%_user_id%%/deposits' 
                method='POST' 
                contents="authenticity_token=%%_authenticity_token%%&amp;deposit%5Bamount%5D=-%%_amount%%">
              </http>
            </request>
          </if>
        </transaction>
      </for>

      <transaction name="deposits">
        <request subst="true">
          <http url='/users/%%_user_id%%/deposits'></http>
        </request>
      </transaction>

      <!-- PROCESS ORDERS --> 

      <!-- Each user has 3 chances to create order -->
      <for from="1" to="3" incr="1" var="order_counter">
        <thinktime value="3" random="true"></thinktime><!--DO NOT PUT THINKTIME IN TRANSACTION!-->
        <setdynvars sourcetype="random_number" start="1" end="4">
          <var name="company_id" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="100" end="300">
          <var name="price" />
        </setdynvars>

        <!-- Should we make users internd to buy instead of sell?--> 
        <setdynvars sourcetype="random_number" start="1" end="2">
          <var name="type" />
        </setdynvars>

        <transaction name="new_order">
          <request subst="true">
            <!-- <dyn_variable name="authenticity_token"/> Somehow it cannot be obtained--> 
            <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
            <http url='/users/%%_user_id%%/orders/new'></http>
          </request>
        </transaction>

        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
          <var name="authenticity_token"/>
        </setdynvars>

        <transaction name="create_order">
          <request subst="true">
            <http 
              url='/users/%%_user_id%%/orders' 
              method='POST' 
              contents="authenticity_token=%%_authenticity_token%%&amp;order%5Bprice%5D=%%_price%%&amp;order%5Bcompany_id%5D=%%_company_id%%&amp;order%5Border_type%5D=%%_type%%&amp;order%5Buser_id%5D=%%_user_id%%">    
            </http>
          </request>
        </transaction>
      </for> 

      <transaction name="orders">
        <request subst="true">
          <http url='/users/%%_user_id%%/orders'></http>
        </request>
      </transaction>
    </session> 
  </sessions>
</tsung>