tsung/SP-Tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="siddarth.phtsmfeyep.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="30" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="4000"></option>
  </options>

  <sessions>
    <!-- Section 1: Companies related! --> 
    <session name="Company" probability="100" type="ts_http">
      
      <transaction name="show_companies_index">
        <request>
          <http url='/companies'></http>
        </request>
      </transaction>

      <transaction name="show_company_new">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url='/companies/new'></http>
        </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars> 

      <thinktime random="true" value="4"/> 
      
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="share"/>
      </setdynvars>

      <setdynvars sourcetype="random_string" length="5">
        <var name="rndstring" />
      </setdynvars>

      <transaction name="post_company">
        <request subst="true">
          <dyn_variable name="created_company_id" re="Location: http://.*/companies/(.*)\r"/>
          <http url='/companies' method='POST' contents="authenticity_token=%%_authenticity_token%%&amp;company%5Bname%5D=%%_rndstring%%&amp;company%5Bticker%5D=%%_rndstring%%&amp;company%5Bshares%5D=%%_share%%"></http>
        </request>
      </transaction>

      <transaction name="view_company_id">
        <request subst="true">
          <http url='/companies/%%_created_company_id%%'></http>
        </request>
      </transaction>

      <transaction name="show_companies_index2">
        <request>
          <!--Ehhhh so hopeless to obtain the token...-->
          <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
          <http url='/companies'></http>
        </request>

        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
          <var name="authenticity_token"/>
        </setdynvars> 
      </transaction>

      <thinktime random='true' value='1'/>

      <transaction name="delete_company_id">
        <request subst="true">
          <http 
            url='/companies/%%_created_company_id%%' 
            method='POST' 
            contents="_method=delete&amp;authenticity_token=%%_authenticity_token%%"></http>
        </request>
      </transaction>
    

    </session>


    <!-- Section 2: Users related! --> 
    <!--
    <session name="Create User" probability="40" type="ts_http">
      <request>
        <http url='/users'></http>
      </request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url='/users/new'></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars> 

      <thinktime random="true" value="4"/> 
      
      <setdynvars sourcetype="random_string" length="13">
        <var name="rndstring" />
      </setdynvars>

      <setdynvars sourcetype="random_random_number" start="10" end="10000000">
        <var name="rndnum" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name="created_user_id" re="Location: http://.*/users/(.*)\r"/>
        <http url='/users' method='POST' contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bname%5D=%%_rndstring%%&amp;user%5Bbalance%5D=%%_rndnum%%"></http>
      </request>

      <request subst="true">
        <http url='/users/%%_created_user_id%%'></http>
      </request>
    </session>

    -->

    <!-- Section 3: Orders related! --> 
    <!-- 
    <session name="View Trades" probability="10" type="ts_http">
      <request>
        <http url='/trades'></http>
      </request>

      <thinktime random="true" value="4"/> 
      
      <request>
        <http url='/trades'></http>
      </request>
      
    </session>
    -->

  </sessions>
</tsung>